# Summary of SQL Questions on Leetcode

## Topic 1: Using function, Limit (offset), Rank

### Q176. Second Highest Salary (Difficulty Level: Easy)

In [ ]:
select DISTINCT salary as SecondHighestSalary
FROM Employee 
ORDER BY Salary DESC LIMIT 1, 1;

### Q177. Nth Highest Salary (Medium)

In [ ]:
#My Solution using MySQL:

CREATE FUNCTION getNthHighestSalary(N INT) RETURNS INT
BEGIN
DECLARE M INT;
SET M=N-1;
  RETURN (
      # Write your MySQL query statement below.
      SELECT DISTINCT Salary FROM Employee ORDER BY Salary DESC LIMIT M, 1
  );
END

### Q178. Rank Scores (Medium)

In [ ]:
SELECT
  Score,
  (SELECT count(distinct Score) FROM Scores WHERE Score >= s.Score) Rank
FROM Scores s
ORDER BY Score desc

### Q574. Winning Candidate (Medium)

In [ ]:
select c.name 
from candidate c, vote v
where c.id = v.candidateId
group by v.candidateId
order by count(candidateId) desc limit 1;

### Q586. Customer Placing the Largest Number of Orders (Easy)

In [ ]:
SELECT s1.customer_number
FROM 
     (SELECT customer_number, count(customer_number) as "count"
      FROM orders
      GROUP BY customer_number
      ORDER BY count DESC) AS s1
LIMIT 1;

### Q602. Friend Requests II: Who Has the Most Friends (Medium)

In [ ]:
select id1 as id, count(id2) as num
from
(select requester_id as id1, accepter_id as id2 
from request_accepted
union 
select accepter_id as id1, requester_id as id2 
from request_accepted) tmp1
group by id1 
order by num desc limit 1

### Q619. Biggest Single Number (Easy)

In [ ]:
select num from
my_numbers
group by num
having count(*) = 1
order by num desc limit 1;

## Topic 2: SQL Basics

### Q182. Duplicate Emails (Easy)

In [ ]:
select Email
from person 
group by email
having count(*) > 1;

### Q196. Delete Duplicate Emails (Easy)

In [ ]:
Delete p1
from person as p1, person as p2
where p1.email = p2.email
and p1.id > p2.id

### Q197. Rising Temperature (Easy)

In [ ]:
SELECT tb1.Id
FROM Weather as tb1
JOIN Weather as tb2
ON tb1.RecordDate = tb2.RecordDate + 1
WHERE tb1.Temperature > tb2.Temperature;

### Q262. Trips and Users (Hard)

In [ ]:
SELECT T.Request_at AS Day, ROUND((SUM(T.Status NOT LIKE 'Completed') / COUNT(*)), 2) AS 'Cancellation Rate'
FROM Trips as T
JOIN Users as U
ON T.Client_Id = U.Users_Id
WHERE U.Banned = 'No' 
AND Request_at Between '2013-10-01' and '2013-10-03'
GROUP BY Request_at

### Q569. Median Employee Salary (Hard)

In [ ]:
SELECT
  id,
  Company,
  Salary
FROM Employee e
WHERE 1 >= ABS((SELECT COUNT(*) FROM Employee e1 WHERE e.company = e1.company AND e.Salary >= e1.Salary) -
           (SELECT COUNT(*) FROM Employee e2 WHERE e.company = e2.company AND e.Salary <= e2.Salary)) 
GROUP BY Company, Salary

### Q570. Managers with at Least 5 Direct Reports (Medium)

In [ ]:
SELECT tb2.Name FROM Employee tb1, Employee tb2
WHERE tb1.ManagerId = tb2.Id
GROUP BY tb2.Name
HAVING COUNT(*) >= 5;

### Q571. Find Median Given Frequency of Numbers (Hard)

In [ ]:
select avg(n.Number) median
from Numbers n
where n.Frequency >= abs((select sum(Frequency) from Numbers where Number<=n.Number) -
                         (select sum(Frequency) from Numbers where Number>=n.Number));

### Q579. Find Cumulative Salary of an Employee (Hard)

In [ ]:
SELECT   A.Id, MAX(B.Month) as Month, SUM(B.Salary) as Salary
FROM     Employee A, Employee B
WHERE    A.Id = B.Id AND B.Month BETWEEN (A.Month-3) AND (A.Month-1)
GROUP BY A.Id, A.Month
ORDER BY Id, Month DESC;

### Q585. Investments in 2016 (Medium)

In [1]:
SELECT SUM(tb1.TIV_2016) AS TIV_2016
FROM insurance tb1
WHERE tb1.TIV_2015 IN
(
SELECT TIV_2015 
FROM insurance
GROUP BY TIV_2015
HAVING COUNT(*) > 1
)
AND CONCAT(tb1.LAT,tb1.LON) IN
(
SELECT CONCAT(LAT, LON)
FROM insurance
GROUP BY LAT, LON
HAVING COUNT(*) = 1
);

SyntaxError: invalid syntax (<ipython-input-1-2ce8dfaa1717>, line 1)

### Q608. Tree Node (Medium)

In [ ]:
SELECT id, 
    CASE WHEN p_id IS NULL THEN 'Root'
         WHEN (p_id IS NOT NULL AND id IN (
                                            SELECT p_id FROM tree)) THEN 'Inner'
         ELSE 'Leaf'
    END AS Type
FROM tree;

### Q610. Triangle Judgement (Easy)

In [ ]:
SELECT X, Y, Z,
CASE WHEN (x + y > z) and (x + z >y) and (y+z >=x) THEN 'Yes'
ELSE 'No'
END AS 'triangle'
FROM triangle

### Q612. Shortest Distance in a Plane (Medium)

In [ ]:
SELECT ROUND(SQRT(MIN((TB1.X-TB2.X)*(TB1.X-TB2.X) + (TB1.Y-TB2.Y)*(TB1.Y-TB2.Y))),2) as shortest
FROM point_2d as TB1, point_2d as TB2
WHERE TB1.X <> TB2.X 
OR TB1.Y <> TB2.Y;

### Q613. Shortest Distance in a Line (Easy)

In [ ]:
SELECT MIN(ABS(TB1.X - TB2.X)) AS  shortest
FROM point TB1, POINT TB2
WHERE TB1.X <> TB2.X

### Q626. Exchange Seats (Medium)

In [ ]:
select case when id%2<>0 and id <> (max(id) over ()) then id+1
            when id%2=0 then id-1
            when id = (max(id) over ()) and id%2<>0 then id
end as id, student
from seat
order by id

### Q614. Second Degree Follower (Medium)

In [ ]:
select followee as follower, count(distinct follower) as num
from follow 
where followee in (select follower from follow)
group by followee 
having count(*) >=1;

## Topic 3: Joins

### Q181. Employees Earning More Than Their Managers (Easy)

In [ ]:
SELECT tb1.Name as Employee
FROM Employee tb1
LEFT JOIN Employee tb2
ON tb1.ManagerId = tb2.Id
WHERE tb1.Salary > tb2.Salary

### Q183. Customers Who Never Order (Easy)

In [ ]:
SELECT C.Name as Customers
FROM Customers C
LEFT JOIN Orders O
ON C.Id = O.CustomerId
WHERE O.CustomerId IS NULL

### Q184. Department Highest Salary (Medium)

In [ ]:
SELECT D.Name as Department, temp.Name as Employee, temp.SALARY
FROM Department D,
(
SELECT E.Id, E.Name, E.Salary, E.DepartmentId FROM Employee E JOIN
    (SELECT DepartmentId, MAX(SALARY) AS MAXIMUMSALARY 
     FROM Employee
     GROUP BY DepartmentId) Q
     ON E.DepartmentId = Q.DepartmentId
     WHERE E.Salary = MAXIMUMSALARY
) temp
WHERE D.Id = temp.DepartmentId

### Q185. Department Top Three Salaries (Hard)

In [ ]:
select d.name as department, tb1.name as employee, tb1.salary
from employee tb1
left join department d
on tb1.departmentid = d.id
where 
(select count(distinct tb2.salary)
from employee tb2
where tb2.salary > tb1.salary
and tb1.departmentid = tb2.departmentid) < 3

### Q580. Count Student Number in Departments (Medium)

In [ ]:
SELECT d.dept_name, COUNT(s.student_id) AS student_number
FROM student s RIGHT JOIN department d ON s.dept_id = d.dept_id
GROUP BY d.dept_name 
ORDER BY student_number DESC, d.dept_name;

### Q607. Sales Person (Easy)

In [ ]:
SELECT S.name 
FROM salesperson as S
WHERE S.sales_id NOT IN(
        SELECT sales_id FROM Orders as O
        JOIN company as C
        ON O.com_id = C.com_id
        WHERE C.name = 'RED')

### Q615. Average Salary: Departments VS Company (Hard)

In [ ]:
SELECT
  LEFT(s.pay_date, 7) as pay_month,
  e.department_id,
  CASE
    WHEN (ROUND(AVG(s.amount), 4) > sub.cavg ) THEN 'higher'
    WHEN (ROUND(AVG(s.amount), 4) < sub.cavg ) THEN 'lower'
    ELSE 'same'
  END as comparison
FROM salary s
LEFT JOIN employee e ON s.employee_id = e.employee_id
LEFT JOIN (
    SELECT
      LEFT(pay_date, 7) as mon,
      ROUND(AVG(amount), 4) as cavg
    FROM salary
    GROUP BY mon
) sub ON LEFT(s.pay_date, 7) = sub.mon
GROUP BY pay_month, e.department_id
ORDER BY pay_month DESC, e.department_id;

### Q627. Swap Salary (Easy)

In [ ]:
UPDATE SALARY
SET sex = case when sex = 'm' then 'f'
                else 'm'
    end;

## Topic 4: Pivoting

### Q618. Students Report By Geography (Hard)

In [ ]:
SELECT MAX(a.America) AS "America", MAX(a.Asia) AS "Asia", MAX(a.Europe) AS "Europe"
FROM
(
SELECT name, continent, ROW_NUMBER() OVER (PARTITION BY continent ORDER BY name) AS row_count,
CASE
WHEN continent = 'America' THEN name
END AS America,
CASE
WHEN continent = 'Asia' THEN name
END AS Asia,
CASE
WHEN continent = 'Europe' THEN name
END AS Europe
FROM student
) AS a
GROUP BY row_count
ORDER BY row_count

## Topic 5: Lag

### Q180. Consecutive Numbers (Easy)

In [ ]:
Select l1.Num as ConsecutiveNums
FROM Logs as l1, Logs as l2, Logs as l3
WHERE l1.id = l2.id + 1 AND l2.id = l3.id+1 
AND l1.Num = l2.Num 
AND l2.Num = l3.Num

### Q603. Consecutive Available Seats (Easy)

In [ ]:
select lag1.seat_id
from cinema lag1, cinema lag2, cinema lag3
where (lag1.seat_id + 1 = lag2.seat_id 
       and lag1.seat_id - 1 = lag3.seat_id 
       and lag1.free = 1 
       and lag2.free = 1 
       and lag3.free = 1)
or
(lag1.seat_id + 1 = lag2.seat_id 
 and lag1.seat_id + 2 = lag3.seat_id 
 and lag1.free = 1 
 and lag2.free = 1 
 and lag3.free = 1)
or
(lag1.seat_id - 1 = lag2.seat_id 
 and lag1.seat_id - 2 = lag3.seat_id 
 and lag1.free = 1 
 and lag2.free = 1 
 and lag3.free = 1)

## Topic 6: Getting Rates

### Q578. Get Highest Answer Rate Question (Medium)

In [ ]:
select question_id as survey_log
from survey_log
group by question_id
order by sum(action like 'answer')/count(*) desc limit 1;

### Q597. Friend Requests I: Overall Acceptance Rate (Easy)

In [ ]:
SELECT ifnull(Round(count(distinct requester_id, accepter_id) / count(distinct sender_id, send_to_id), 2),0) as accept_rate
FROM request_accepted, friend_request